[
"In case you miss it....<br><br>Blog Post - <a href=\"https://kirr.co/9851bc\">https://kirr.co/9851bc</a><br>Github Repo - <a href=\"https://kirr.co/ivq0ff\">https://kirr.co/ivq0ff</a><br>Heroku Container Reference - <a href=\"https://kirr.co/1hg9ls\">https://kirr.co/1hg9ls</a><br><br><a href=\"https://www.youtube.com/watch?v=GoJ6qR2VMTA&amp;t=00h00m00s\">00:00:00</a> Welcome<br><a href=\"https://www.youtube.com/watch?v=GoJ6qR2VMTA&amp;t=0h01m08s\">0:01:08</a> 1 - General Overview<br><a href=\"https://www.youtube.com/watch?v=GoJ6qR2VMTA&amp;t=0h06m40s\">0:06:40</a> 2 - Setup Base Project<br><a href=\"https://www.youtube.com/watch?v=GoJ6qR2VMTA&amp;t=0h08m52s\">0:08:52</a> 3 - Jupyter Notebook Server Configuration<br><a href=\"https://www.youtube.com/watch?v=GoJ6qR2VMTA&amp;t=0h16m32s\">0:16:32</a> 4 - Packaging Notebooks for Container Builds<br><a href=\"https://www.youtube.com/watch?v=GoJ6qR2VMTA&amp;t=0h22m17s\">0:22:17</a> 5 - Create the Minimal Dockerfile<br><a href=\"https://www.youtube.com/watch?v=GoJ6qR2VMTA&amp;t=0h25m00s\">0:25:00</a> 6 - Dockerfile CMD Entrypoint<br><a href=\"https://www.youtube.com/watch?v=GoJ6qR2VMTA&amp;t=0h27m12s\">0:27:12</a> 7 - Build &amp; Run with Docker<br><a href=\"https://www.youtube.com/watch?v=GoJ6qR2VMTA&amp;t=0h35m11s\">0:35:11</a> 8 - Push &amp; Release on Heroku<br><a href=\"https://www.youtube.com/watch?v=GoJ6qR2VMTA&amp;t=0h40m18s\">0:40:18</a> 9 - Bonus Installs<br><a href=\"https://www.youtube.com/watch?v=GoJ6qR2VMTA&amp;t=0h47m39s\">0:47:39</a> 10 - Thank you",
"Bro files automatically deleting after some time in heroku jupyter please help me please",
"Superb tutorial, so much to unpack in 45 min - thank you Justin!",
"Thanks for this great tutorial. I&#39;ve learnt more from it.",
"jupyter rstudio docker load on heroku ,can it do",
"Can we use docker compose for deploy in heroku?",
"Thank you for this! So since we&#39;re running notebooks within a container, does that mean it won&#39;t count against our free dyno hours on Heroku?  I want to use it to practice machine learning with the MNIST dataset.",
"One of most fluid video on jupyter env deployment!",
"Hey man, thank you for this amazing video!",
"For windows users, .bat scripts also work perfectly fine. Good job this tutorial Sir",
"After each section, that music makes me wanna party that I have learned something. 😂 <br>Great tutorial. Thanks",
"Nyc tutorial bro, ❤ From India",
"Thank you for the great content you&#39;re providing! Would you consider doing a tutorial on microservice system architecture for how we could bring together some of these projects into one larger system?<br><br>For example, it would be cool to learn how to build a system with 3 main microservices mostly independent of eachother, like:<br>1. a web scraper service that scrapes, cleans, and saves the cleaned data into a database<br>2. another service (Flask REST API?) that can read data from that database and send it to clients (many rows at a time)<br>3. a client that requests a (clean) dataset from the service in 2. above, which could do anything, maybe train a ML model, maybe just print the data for proof of concept.<br><br>I feel like this would really open the door for understanding how to build up different systems like the example I described, since I feel I have almost got a good handle on the different &quot;blocks&quot; in the system, but I am quite confused / clueless when it comes to the &quot;glue&quot;, for bringing different blocks together in a scalable / general way.",
"Everything worked fine...<br>for windows users using docker toolbox<br>- replace CLRF line endings with LF  in scripts and<br>- use ip <a href=\"http://192.168.99.100/\">192.168.99.100</a> instead of localhost<br><br>great content 😁<br>keep them coming",
"Your website keeps redirecting to login page. Will you fix is please😊. Great Contents😊",
"Nice video 👍 Need more this type of content",
"Justin what version of Django would you recommend a beginner to learn and what version to deploy?",
"I&#39;m on Windows:(<br>Doesn&#39;t docker behave differently for Windows? <br>Like almost everything else.<br><br>Edit: was thinking of hosting a Jupyter notebook yesterday, this is nice to see. <br><br>Do we keep the &quot;sha1:&quot; in the password string? <br><br>I&#39;m newb / used to javascript where we would hash it in a different file then import it.",
"so i just noticed <a href=\"http://tight.ai/\">tight.ai</a> hat..?<br>what that&#39;s about...?"
]